{"articles":[{"title":"01: Twelve Modern CSS One-Line Upgrades","link":"https://frontendfoc.us/link/163630/web","description":"Stephanie shared this list of a dozen CSS properties that are well worth knowing earlier in the year — the one-line upgrades here will help reduce technical debt, remove unnecessary lines of JavaScript, and score some easy wins for the user experience, too.","source":"moderncss.dev","author":"Stephanie Eckles ","category":"topnews"},{"title":"02: Five CSS Snippets Every Frontend Developer Should Know in 2024","link":"https://frontendfoc.us/link/163631/web","description":"Adam did this <a target=\"_blank\" href=\"https://frontendfoc.us/link/163632/web\" style=\"text-decoration: none; color: #D94306;\">in 2023</a>, and the 2024 version proved very popular too. All the snippets here are toolbelt worthy, powerful, CSS tips (including nesting, sub grid, container query units, etc) that will be just as valuable as we head into 2025.","source":"web.dev","author":"Adam Argyle ","category":"topnews"},{"title":"03: Inline Conditionals in CSS?","link":"https://frontendfoc.us/link/163633/web","description":"In the summer the CSS Working Group <a target=\"_blank\" href=\"https://frontendfoc.us/link/163634/web\" style=\"text-decoration: none; color: #D94306;\">resolved to add</a> an inline <code>if()</code> to CSS. An exciting step for CSS, but one that raises lots of questions too. This explainer from Lea proved valuable for many.","source":"lea.verou.me","author":"Lea Verou ","category":"topnews"},{"title":"04: What You Need to Know about Modern CSS","link":"https://frontendfoc.us/link/163635/web","description":"A bookmarkable guide from this past Spring featuring a list of all the then new additions to CSS (<em>think nesting, view transitions, <code>:has()</code>, etc</em>). It remains really handy, as there’s an explainer, demo, code example, and a quick bit of detail as to why you should care about each&nbsp;entry. If you want to scrub up on what new CSS features we've gotten this year, this ain't a bad place to look.","source":"frontendmasters.com","author":"Chris Coyier ","category":"topnews"},{"title":"05: How to Center a Div","link":"https://frontendfoc.us/link/163649/web","description":"The fact that so many of you tapped on this one tells us that it's still something of a tricky ordeal to get right. Yes, it's easier now thanks to new tools (Flex, Grid, etc), but which to use? Josh shares the trade-offs between different approaches, and the best strategies to use.","source":"www.joshwcomeau.com","author":"Josh W Comeau ","category":"topnews"},{"title":"06: The Magic of Clip Path","link":"https://frontendfoc.us/link/163650/web","description":"This post sets out to “inspire you and show you that thinking outside the box can lead to some great animations” — all via the magic of the very powerful <code>clip-path</code> CSS&nbsp;property.","source":"emilkowal.ski","author":"Emil Kowalski ","category":"topnews"},{"title":"07: CSS Selectors","link":"https://frontendfoc.us/link/163652/web","description":"A thorough, complete guide covering all of the various methods we have to select elements in CSS (such as pseudo-selectors, nested selectors, attribute selectors, etc) and how to use them for applying&nbsp;styles.","source":"css-tricks.com","author":"Geoff Graham ","category":"topnews"},{"title":"08: An Interactive Guide to CSS Container Queries","link":"https://frontendfoc.us/link/163653/web","description":"This is a detailed explainer on <a target=\"_blank\" href=\"https://frontendfoc.us/link/163654/web\" style=\"text-decoration: none; color: #D94306;\">CSS container queries</a>, exploring the problems they solve, how they work, and how we can use them in our workflows. Lots of code and visuals to help things along too. Well worth&nbsp;bookmarking.","source":"ishadeed.com","author":"Ahmad Shadeed ","category":"topnews"},{"title":"09: How to Make Your Web Page Faster Before It Even Loads","link":"https://frontendfoc.us/link/163656/web","description":"Salma looked at the events that happen <em>before</em> the first byte of a web page is even received by the browser. Asking if we can measure those events, and subsequently optimize them to make our web pages and applications load even&nbsp;faster. Neat.","source":"blog.sentry.io","author":"Salma Alam-Naylor ","category":"topnews"},{"title":"10: The Frontend Developer/Engineer Handbook 2024","link":"https://frontendfoc.us/link/163657/web","description":"This incredibly in-depth and detailed guide on the current web development landscape was well received. It's remains a superb resource for getting up to speed on everything from code editors, CSS, UX, UI, the command line, performance, accessibility, testing, AI, and much, much&nbsp;more.","source":"frontendmasters.com","author":"Cody Lindley ","category":"topnews"},{"title":"Anchor Position Tool","link":"https://frontendfoc.us/link/163658/web","description":"CSS anchor positioning is on the way, and one rather neat layout mechanism that’s part of the spec is <code>position-area</code>. This (Chromium 129+ only) demo from Una demonstrates how it works. There was plenty of interest in this one, and although it's still in <a target=\"_blank\" href=\"https://frontendfoc.us/link/163659/web\" style=\"text-decoration: none; color: #D94306;\">draft</a>, it should prove rather powerful once widely&nbsp;available.","source":"anchor-tool.com","author":"Una Kravets ","img":"https://res.cloudinary.com/cpress/image/upload/w_1280,e_sharpen:60,q_auto/v1734427865/pz0ucwv4k2etm8jfyt8x.png","category":"topnews"},{"title":"Speedometer 3.0: A Browser Benchmark for Webapp Responsiveness","link":"https://frontendfoc.us/link/163660/web","description":"2024 gave us a new major release of Speedometer — the first with a cross-industry collaborative approach supported by each major browser engine (Blink, Gecko, WebKit). <a target=\"_blank\" href=\"https://frontendfoc.us/link/163661/web\" style=\"text-decoration: none; color: #D94306;\">Version 3</a> added in many new tests, performance wins, and improvements. You can <a target=\"_blank\" href=\"https://frontendfoc.us/link/163662/web\" style=\"text-decoration: none; color: #D94306;\">run the test for yourself&nbsp;here.</a>","source":"browserbench.org","author":"Apple, Google, Microsoft, and Mozilla ","category":"topnews"},{"title":"CSS Grid Generator","link":"https://frontendfoc.us/link/163663/web","description":"This handy browser-based tool got plenty of you clicking —&nbsp;you can use it to easily create custom CSS grid layouts — you can specify the number of columns, rows, and gutter&nbsp;size.","source":"cssgridgenerator.io","author":"Kristjan Retter ","category":"topnews"}]}